experiments/workflow/boki-hotel/expected_results/qps200/wrk_warmup.log
Running 30s test @ http://ip-172-31-7-164.us-east-2.compute.internal:8080
  2 threads and 2 connections
  Thread calibration: mean lat.: 0.845ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.774ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   818.98us  296.95us   2.82ms   59.23%
    Req/Sec   103.73     13.58   200.00     98.39%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  821.00us
 75.000%    1.07ms
 90.000%    1.21ms
 99.000%    1.34ms
 99.900%    1.37ms
 99.990%    2.82ms
 99.999%    2.82ms
100.000%    2.82ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.211     0.000000            2         1.00
       0.422     0.100000          401         1.11
       0.515     0.200000          800         1.25
       0.622     0.300000         1209         1.43
       0.720     0.400000         1601         1.67
       0.821     0.500000         2001         2.00
       0.871     0.550000         2200         2.22
       0.917     0.600000         2402         2.50
       0.970     0.650000         2600         2.86
       1.023     0.700000         2799         3.33
       1.070     0.750000         3000         4.00
       1.093     0.775000         3103         4.44
       1.117     0.800000         3199         5.00
       1.137     0.825000         3301         5.71
       1.161     0.850000         3402         6.67
       1.185     0.875000         3500         8.00
       1.197     0.887500         3551         8.89
       1.211     0.900000         3601        10.00
       1.230     0.912500         3653        11.43
       1.252     0.925000         3699        13.33
       1.269     0.937500         3750        16.00
       1.279     0.943750         3774        17.78
       1.288     0.950000         3800        20.00
       1.296     0.956250         3824        22.86
       1.305     0.962500         3849        26.67
       1.314     0.968750         3879        32.00
       1.317     0.971875         3890        35.56
       1.321     0.975000         3899        40.00
       1.324     0.978125         3918        45.71
       1.326     0.981250         3924        53.33
       1.329     0.984375         3937        64.00
       1.333     0.985938         3946        71.11
       1.334     0.987500         3949        80.00
       1.336     0.989062         3955        91.43
       1.338     0.990625         3961       106.67
       1.344     0.992188         3968       128.00
       1.345     0.992969         3970       142.22
       1.349     0.993750         3974       160.00
       1.351     0.994531         3977       182.86
       1.352     0.995313         3980       213.33
       1.356     0.996094         3983       256.00
       1.357     0.996484         3985       284.44
       1.358     0.996875         3986       320.00
       1.359     0.997266         3988       365.71
       1.361     0.997656         3989       426.67
       1.364     0.998047         3992       512.00
       1.364     0.998242         3992       568.89
       1.364     0.998437         3992       640.00
       1.368     0.998633         3993       731.43
       1.372     0.998828         3994       853.33
       1.381     0.999023         3995      1024.00
       1.381     0.999121         3995      1137.78
       1.381     0.999219         3995      1280.00
       1.384     0.999316         3996      1462.86
       1.384     0.999414         3996      1706.67
       2.579     0.999512         3997      2048.00
       2.579     0.999561         3997      2275.56
       2.579     0.999609         3997      2560.00
       2.579     0.999658         3997      2925.71
       2.579     0.999707         3997      3413.33
       2.823     0.999756         3998      4096.00
       2.823     1.000000         3998          inf
#[Mean    =        0.819, StdDeviation   =        0.297]
#[Max     =        2.822, Total count    =         3998]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%  230.00us
 75.000%  255.00us
 90.000%  275.00us
 99.000%  307.00us
 99.900%  349.00us
 99.990%    2.61ms
 99.999%    2.61ms
100.000%    2.61ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.156     0.000000            2         1.00
       0.188     0.100000          410         1.11
       0.201     0.200000          822         1.25
       0.211     0.300000         1221         1.43
       0.221     0.400000         1613         1.67
       0.230     0.500000         2007         2.00
       0.235     0.550000         2229         2.22
       0.240     0.600000         2432         2.50
       0.244     0.650000         2604         2.86
       0.250     0.700000         2837         3.33
       0.255     0.750000         3018         4.00
       0.258     0.775000         3126         4.44
       0.261     0.800000         3226         5.00
       0.263     0.825000         3304         5.71
       0.267     0.850000         3414         6.67
       0.271     0.875000         3519         8.00
       0.273     0.887500         3569         8.89
       0.275     0.900000         3609        10.00
       0.277     0.912500         3664        11.43
       0.279     0.925000         3715        13.33
       0.282     0.937500         3765        16.00
       0.283     0.943750         3780        17.78
       0.284     0.950000         3799        20.00
       0.286     0.956250         3828        22.86
       0.288     0.962500         3857        26.67
       0.290     0.968750         3880        32.00
       0.291     0.971875         3887        35.56
       0.293     0.975000         3902        40.00
       0.295     0.978125         3915        45.71
       0.297     0.981250         3925        53.33
       0.300     0.984375         3936        64.00
       0.302     0.985938         3943        71.11
       0.304     0.987500         3953        80.00
       0.306     0.989062         3956        91.43
       0.307     0.990625         3961       106.67
       0.309     0.992188         3967       128.00
       0.310     0.992969         3970       142.22
       0.312     0.993750         3974       160.00
       0.315     0.994531         3977       182.86
       0.316     0.995313         3980       213.33
       0.318     0.996094         3983       256.00
       0.325     0.996484         3984       284.44
       0.330     0.996875         3986       320.00
       0.333     0.997266         3988       365.71
       0.337     0.997656         3989       426.67
       0.340     0.998047         3992       512.00
       0.340     0.998242         3992       568.89
       0.340     0.998437         3992       640.00
       0.348     0.998633         3993       731.43
       0.349     0.998828         3994       853.33
       0.352     0.999023         3995      1024.00
       0.352     0.999121         3995      1137.78
       0.352     0.999219         3995      1280.00
       0.362     0.999316         3996      1462.86
       0.362     0.999414         3996      1706.67
       1.555     0.999512         3997      2048.00
       1.555     0.999561         3997      2275.56
       1.555     0.999609         3997      2560.00
       1.555     0.999658         3997      2925.71
       1.555     0.999707         3997      3413.33
       2.611     0.999756         3998      4096.00
       2.611     1.000000         3998          inf
#[Mean    =        0.232, StdDeviation   =        0.054]
#[Max     =        2.610, Total count    =         3998]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6002 requests in 30.00s, 0.93MB read
Requests/sec:    200.06
Transfer/sec:     31.85KB